src/config/InformationRegisters/ОтветыПеревозчиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ОтветыПеревозчиков</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаТранспорт</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПрибытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРазгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Авто</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаЗаполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>КодПеревозчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Guid</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/config/WebServices/ServiceCarrier/Ext/Module.bsl
Функция CarrierAnswer(CarrierId="", GuidIn1S="", ArrivalDate, UnloadDate, Cost=0, Car="", Driver="")
	рез = "";
	
	структура1 = новый Структура;
	структура1.Вставить("КодПеревозчика", CarrierId);
	структура1.Вставить("Guid", GuidIn1S);
	структура1.Вставить("ДатаПрибытия", ArrivalDate);
	структура1.Вставить("ДатаРазгрузки", UnloadDate);
	структура1.Вставить("Стоимость", Cost);
	структура1.Вставить("Авто", Car);
	структура1.Вставить("Водитель", Driver);
	структура1.Вставить("ДатаЗаполнения", ТекущаяДата() );
	
	регСв = РегистрыСведений.ОтветыПеревозчиков.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(регСв, структура1);
	
		док = документы.ЗаявкаНаТранспорт.ПолучитьСсылку(GuidIn1S);	
		Если док.Пустая() тогда
		  	рез = "ERROR: No document by GUID "+GuidIn1S;
		Иначе
			регСв.Документ = док;
			рез = "Ok.";
		КонецЕсли;
		
	регСв.Записать();
			
	возврат рез;
	
КонецФункции
